;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; CourseProject.asm
;  
; освновной файл проекта
; сюда добавляем уже протестированный фнкционал
; коммитить сюда только при полной работоспособности
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

; подключение базовых макросов
include macros.inc

; <каноничный исходним со всякими SEGMENT 'CODE' goes here>

; подключение базового функционала
include common.inc